GopalSaraf/Practicals/PSDL/include/proc/pic18f26k42.inc
// Register: NCO1INCU
#define NCO1INCU NCO1INCU
NCO1INCU                                 equ 03F3Dh
// bitfield definitions
NCO1INCU_INC_POSN                        equ 0000h
NCO1INCU_INC_POSITION                    equ 0000h
NCO1INCU_INC_SIZE                        equ 0004h
NCO1INCU_INC_LENGTH                      equ 0004h
NCO1INCU_INC_MASK                        equ 000Fh
NCO1INCU_NCO1INC16_POSN                  equ 0000h
NCO1INCU_NCO1INC16_POSITION              equ 0000h
NCO1INCU_NCO1INC16_SIZE                  equ 0001h
NCO1INCU_NCO1INC16_LENGTH                equ 0001h
NCO1INCU_NCO1INC16_MASK                  equ 0001h
NCO1INCU_NCO1INC17_POSN                  equ 0001h
NCO1INCU_NCO1INC17_POSITION              equ 0001h
NCO1INCU_NCO1INC17_SIZE                  equ 0001h
NCO1INCU_NCO1INC17_LENGTH                equ 0001h
NCO1INCU_NCO1INC17_MASK                  equ 0002h
NCO1INCU_NCO1INC18_POSN                  equ 0002h
NCO1INCU_NCO1INC18_POSITION              equ 0002h
NCO1INCU_NCO1INC18_SIZE                  equ 0001h
NCO1INCU_NCO1INC18_LENGTH                equ 0001h
NCO1INCU_NCO1INC18_MASK                  equ 0004h
NCO1INCU_NCO1INC19_POSN                  equ 0003h
NCO1INCU_NCO1INC19_POSITION              equ 0003h
NCO1INCU_NCO1INC19_SIZE                  equ 0001h
NCO1INCU_NCO1INC19_LENGTH                equ 0001h
NCO1INCU_NCO1INC19_MASK                  equ 0008h
NCO1INCU_INC16_POSN                      equ 0000h
NCO1INCU_INC16_POSITION                  equ 0000h
NCO1INCU_INC16_SIZE                      equ 0001h
NCO1INCU_INC16_LENGTH                    equ 0001h
NCO1INCU_INC16_MASK                      equ 0001h
NCO1INCU_INC17_POSN                      equ 0001h
NCO1INCU_INC17_POSITION                  equ 0001h
NCO1INCU_INC17_SIZE                      equ 0001h
NCO1INCU_INC17_LENGTH                    equ 0001h
NCO1INCU_INC17_MASK                      equ 0002h
NCO1INCU_INC18_POSN                      equ 0002h
NCO1INCU_INC18_POSITION                  equ 0002h
NCO1INCU_INC18_SIZE                      equ 0001h
NCO1INCU_INC18_LENGTH                    equ 0001h
NCO1INCU_INC18_MASK                      equ 0004h
NCO1INCU_INC19_POSN                      equ 0003h
NCO1INCU_INC19_POSITION                  equ 0003h
NCO1INCU_INC19_SIZE                      equ 0001h
NCO1INCU_INC19_LENGTH                    equ 0001h
NCO1INCU_INC19_MASK                      equ 0008h
NCO1INCU_NCO1INC_POSN                    equ 0000h
NCO1INCU_NCO1INC_POSITION                equ 0000h
NCO1INCU_NCO1INC_SIZE                    equ 0004h
NCO1INCU_NCO1INC_LENGTH                  equ 0004h
NCO1INCU_NCO1INC_MASK                    equ 000Fh

// Register: NCO1CON
#define NCO1CON NCO1CON
NCO1CON                                  equ 03F3Eh
// bitfield definitions
NCO1CON_PFM_POSN                         equ 0000h
NCO1CON_PFM_POSITION                     equ 0000h
NCO1CON_PFM_SIZE                         equ 0001h
NCO1CON_PFM_LENGTH                       equ 0001h
NCO1CON_PFM_MASK                         equ 0001h
NCO1CON_POL_POSN                         equ 0004h
NCO1CON_POL_POSITION                     equ 0004h
NCO1CON_POL_SIZE                         equ 0001h
NCO1CON_POL_LENGTH                       equ 0001h
NCO1CON_POL_MASK                         equ 0010h
NCO1CON_OUT_POSN                         equ 0005h
NCO1CON_OUT_POSITION                     equ 0005h
NCO1CON_OUT_SIZE                         equ 0001h
NCO1CON_OUT_LENGTH                       equ 0001h
NCO1CON_OUT_MASK                         equ 0020h
NCO1CON_EN_POSN                          equ 0007h
NCO1CON_EN_POSITION                      equ 0007h
NCO1CON_EN_SIZE                          equ 0001h
NCO1CON_EN_LENGTH                        equ 0001h
NCO1CON_EN_MASK                          equ 0080h
NCO1CON_NCO1PFM_POSN                     equ 0000h
NCO1CON_NCO1PFM_POSITION                 equ 0000h
NCO1CON_NCO1PFM_SIZE                     equ 0001h
NCO1CON_NCO1PFM_LENGTH                   equ 0001h
NCO1CON_NCO1PFM_MASK                     equ 0001h
NCO1CON_NCO1POL_POSN                     equ 0004h
NCO1CON_NCO1POL_POSITION                 equ 0004h
NCO1CON_NCO1POL_SIZE                     equ 0001h
NCO1CON_NCO1POL_LENGTH                   equ 0001h
NCO1CON_NCO1POL_MASK                     equ 0010h
NCO1CON_NCO1OUT_POSN                     equ 0005h
NCO1CON_NCO1OUT_POSITION                 equ 0005h
NCO1CON_NCO1OUT_SIZE                     equ 0001h
NCO1CON_NCO1OUT_LENGTH                   equ 0001h
NCO1CON_NCO1OUT_MASK                     equ 0020h
NCO1CON_NCO1EN_POSN                      equ 0007h
NCO1CON_NCO1EN_POSITION                  equ 0007h
NCO1CON_NCO1EN_SIZE                      equ 0001h
NCO1CON_NCO1EN_LENGTH                    equ 0001h
NCO1CON_NCO1EN_MASK                      equ 0080h

// Register: NCO1CLK
#define NCO1CLK NCO1CLK
NCO1CLK                                  equ 03F3Fh
// bitfield definitions
NCO1CLK_CKS_POSN                         equ 0000h
NCO1CLK_CKS_POSITION                     equ 0000h
NCO1CLK_CKS_SIZE                         equ 0004h
NCO1CLK_CKS_LENGTH                       equ 0004h
NCO1CLK_CKS_MASK                         equ 000Fh
NCO1CLK_PWS_POSN                         equ 0005h
NCO1CLK_PWS_POSITION                     equ 0005h
NCO1CLK_PWS_SIZE                         equ 0003h
NCO1CLK_PWS_LENGTH                       equ 0003h
NCO1CLK_PWS_MASK                         equ 00E0h
NCO1CLK_CKS0_POSN                        equ 0000h
NCO1CLK_CKS0_POSITION                    equ 0000h
NCO1CLK_CKS0_SIZE                        equ 0001h
NCO1CLK_CKS0_LENGTH                      equ 0001h
NCO1CLK_CKS0_MASK                        equ 0001h
NCO1CLK_CKS1_POSN                        equ 0001h
NCO1CLK_CKS1_POSITION                    equ 0001h
NCO1CLK_CKS1_SIZE                        equ 0001h
NCO1CLK_CKS1_LENGTH                      equ 0001h
NCO1CLK_CKS1_MASK                        equ 0002h
NCO1CLK_CKS2_POSN                        equ 0002h
NCO1CLK_CKS2_POSITION                    equ 0002h
NCO1CLK_CKS2_SIZE                        equ 0001h
NCO1CLK_CKS2_LENGTH                      equ 0001h
NCO1CLK_CKS2_MASK                        equ 0004h
NCO1CLK_CKS3_POSN                        equ 0003h
NCO1CLK_CKS3_POSITION                    equ 0003h
NCO1CLK_CKS3_SIZE                        equ 0001h
NCO1CLK_CKS3_LENGTH                      equ 0001h
NCO1CLK_CKS3_MASK                        equ 0008h
NCO1CLK_PWS0_POSN                        equ 0005h
NCO1CLK_PWS0_POSITION                    equ 0005h
NCO1CLK_PWS0_SIZE                        equ 0001h
NCO1CLK_PWS0_LENGTH                      equ 0001h
NCO1CLK_PWS0_MASK                        equ 0020h
NCO1CLK_PWS1_POSN                        equ 0006h
NCO1CLK_PWS1_POSITION                    equ 0006h
NCO1CLK_PWS1_SIZE                        equ 0001h
NCO1CLK_PWS1_LENGTH                      equ 0001h
NCO1CLK_PWS1_MASK                        equ 0040h
NCO1CLK_PWS2_POSN                        equ 0007h
NCO1CLK_PWS2_POSITION                    equ 0007h
NCO1CLK_PWS2_SIZE                        equ 0001h
NCO1CLK_PWS2_LENGTH                      equ 0001h
NCO1CLK_PWS2_MASK                        equ 0080h
NCO1CLK_NCO1CKS_POSN                     equ 0000h
NCO1CLK_NCO1CKS_POSITION                 equ 0000h
NCO1CLK_NCO1CKS_SIZE                     equ 0004h
NCO1CLK_NCO1CKS_LENGTH                   equ 0004h
NCO1CLK_NCO1CKS_MASK                     equ 000Fh
NCO1CLK_NCO1PWS_POSN                     equ 0005h
NCO1CLK_NCO1PWS_POSITION                 equ 0005h
NCO1CLK_NCO1PWS_SIZE                     equ 0003h
NCO1CLK_NCO1PWS_LENGTH                   equ 0003h
NCO1CLK_NCO1PWS_MASK                     equ 00E0h
NCO1CLK_NCO1CKS0_POSN                    equ 0000h
NCO1CLK_NCO1CKS0_POSITION                equ 0000h
NCO1CLK_NCO1CKS0_SIZE                    equ 0001h
NCO1CLK_NCO1CKS0_LENGTH                  equ 0001h
NCO1CLK_NCO1CKS0_MASK                    equ 0001h
NCO1CLK_NCO1CKS1_POSN                    equ 0001h
NCO1CLK_NCO1CKS1_POSITION                equ 0001h
NCO1CLK_NCO1CKS1_SIZE                    equ 0001h
NCO1CLK_NCO1CKS1_LENGTH                  equ 0001h
NCO1CLK_NCO1CKS1_MASK                    equ 0002h
NCO1CLK_NCO1CKS2_POSN                    equ 0002h
NCO1CLK_NCO1CKS2_POSITION                equ 0002h
NCO1CLK_NCO1CKS2_SIZE                    equ 0001h
NCO1CLK_NCO1CKS2_LENGTH                  equ 0001h
NCO1CLK_NCO1CKS2_MASK                    equ 0004h
NCO1CLK_NCO1CKS3_POSN                    equ 0003h
NCO1CLK_NCO1CKS3_POSITION                equ 0003h
NCO1CLK_NCO1CKS3_SIZE                    equ 0001h
NCO1CLK_NCO1CKS3_LENGTH                  equ 0001h
NCO1CLK_NCO1CKS3_MASK                    equ 0008h
NCO1CLK_NCO1PWS0_POSN                    equ 0005h
NCO1CLK_NCO1PWS0_POSITION                equ 0005h
NCO1CLK_NCO1PWS0_SIZE                    equ 0001h
NCO1CLK_NCO1PWS0_LENGTH                  equ 0001h
NCO1CLK_NCO1PWS0_MASK                    equ 0020h
NCO1CLK_NCO1PWS1_POSN                    equ 0006h
NCO1CLK_NCO1PWS1_POSITION                equ 0006h
NCO1CLK_NCO1PWS1_SIZE                    equ 0001h
NCO1CLK_NCO1PWS1_LENGTH                  equ 0001h
NCO1CLK_NCO1PWS1_MASK                    equ 0040h
NCO1CLK_NCO1PWS2_POSN                    equ 0007h
NCO1CLK_NCO1PWS2_POSITION                equ 0007h
NCO1CLK_NCO1PWS2_SIZE                    equ 0001h
NCO1CLK_NCO1PWS2_LENGTH                  equ 0001h
NCO1CLK_NCO1PWS2_MASK                    equ 0080h

// Register: CWG3CLK
#define CWG3CLK CWG3CLK
CWG3CLK                                  equ 03F40h
// bitfield definitions
CWG3CLK_CS_POSN                          equ 0000h
CWG3CLK_CS_POSITION                      equ 0000h
CWG3CLK_CS_SIZE                          equ 0001h
CWG3CLK_CS_LENGTH                        equ 0001h
CWG3CLK_CS_MASK                          equ 0001h
CWG3CLK_CWG3CS_POSN                      equ 0000h
CWG3CLK_CWG3CS_POSITION                  equ 0000h
CWG3CLK_CWG3CS_SIZE                      equ 0001h
CWG3CLK_CWG3CS_LENGTH                    equ 0001h
CWG3CLK_CWG3CS_MASK                      equ 0001h

// Register: CWG3ISM
#define CWG3ISM CWG3ISM
CWG3ISM                                  equ 03F41h
// bitfield definitions
CWG3ISM_ISM_POSN                         equ 0000h
CWG3ISM_ISM_POSITION                     equ 0000h
CWG3ISM_ISM_SIZE                         equ 0008h
CWG3ISM_ISM_LENGTH                       equ 0008h
CWG3ISM_ISM_MASK                         equ 00FFh
CWG3ISM_CWG3ISM_POSN                     equ 0000h
CWG3ISM_CWG3ISM_POSITION                 equ 0000h
CWG3ISM_CWG3ISM_SIZE                     equ 0008h
CWG3ISM_CWG3ISM_LENGTH                   equ 0008h
CWG3ISM_CWG3ISM_MASK                     equ 00FFh
CWG3ISM_ISM0_POSN                        equ 0000h
CWG3ISM_ISM0_POSITION                    equ 0000h
CWG3ISM_ISM0_SIZE                        equ 0001h
CWG3ISM_ISM0_LENGTH                      equ 0001h
CWG3ISM_ISM0_MASK                        equ 0001h
CWG3ISM_ISM1_POSN                        equ 0001h
CWG3ISM_ISM1_POSITION                    equ 0001h
CWG3ISM_ISM1_SIZE                        equ 0001h
CWG3ISM_ISM1_LENGTH                      equ 0001h
CWG3ISM_ISM1_MASK                        equ 0002h
CWG3ISM_ISM2_POSN                        equ 0002h
CWG3ISM_ISM2_POSITION                    equ 0002h
CWG3ISM_ISM2_SIZE                        equ 0001h
CWG3ISM_ISM2_LENGTH                      equ 0001h
CWG3ISM_ISM2_MASK                        equ 0004h
CWG3ISM_ISM3_POSN                        equ 0003h
CWG3ISM_ISM3_POSITION                    equ 0003h
CWG3ISM_ISM3_SIZE                        equ 0001h
CWG3ISM_ISM3_LENGTH                      equ 0001h
CWG3ISM_ISM3_MASK                        equ 0008h
CWG3ISM_ISM4_POSN                        equ 0004h
CWG3ISM_ISM4_POSITION                    equ 0004h
CWG3ISM_ISM4_SIZE                        equ 0001h
CWG3ISM_ISM4_LENGTH                      equ 0001h
CWG3ISM_ISM4_MASK                        equ 0010h

